---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GeometryFailures.CurveAndSurfaceDoNotIntersect
source: html/8d255986-7011-f17b-286f-aa9c65ed755b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GeometryFailures.CurveAndSurfaceDoNotIntersect Property

Curve and Surface do not intersect.

## Syntax (C#)
```csharp
public static FailureDefinitionId CurveAndSurfaceDoNotIntersect { get; }
```